{
  "https://afny.org/re-rentals": "Affordable For NY | NYC Housing lottery Re-rentals FAQ How to apply Lottery Process Amenities Subway Household & Income Brooklyn 555 Waverly Avenue- Multiple Units 0825 Rent: $2479.05 Household: 1 Person - 2 People Units: Studio Brooklyn The MC aka 1100 Myrtle Avenue Apartments - 0825 Unit 408 Rent: $2500.00 Household: 1 Person - 2 People Units: 1-Bedroom",
  "https://iaffordny.com/re-rentals": "I Afford NY | NYC Housing lottery How to apply Amenities Subway Household & Income Queens The Urban 144-74 Northern Boulevard -Multiple Units Rent: $2,104.89 - $2,162.77 Household: 1 Person - 3 People Units: 1-Bedroom Bronx 3508 Tryon Avenue Unit 6D 1125 Rent: $1,680 Household: 1 Person - 3 People Units: 1-Bedroom Brooklyn 334 Evergreen Avenue Apartments 0825 Rent: $2,572.5 - $2,632.05 Household: 2 People - 5 People Units: 2-Bedroom Manhattan Sunrose Tower Apartments - 1125 Multiple Units Rent: $2,600 - $3,350 Household: 1 Person - 5 People Units: 1-Bedroom - 2-Bedroom Brooklyn 230 Classon Avenue Apartments - Multiple Units Rent: $2,800 Household: 1 Person - 3 People Units: 1-Bedroom Brooklyn 912 Broadway Apartments -Unit 3I, 3B 0725 Rent: $2,644.75 - $2,717.48 Household: 1 Person - 3 People Units: 1-Bedroom Brooklyn 31-33 LINCOLN ROAD UNIT 2I 1125 Rent: $2,850.04 Household: 2 People - 5 People Units: 2-Bedroom Brooklyn 510 FLATBUSH AVENUE UNIT 8E 0525 Rent: $2,928.75 Household: 2 People - 5 People Units: 2-Bedroom Bronx 113 Father Zeiser Place Apartments - 1025 Unit 4B Rent: $2,597 Household: 1 Person - 3 People Units: 1-Bedroom Brooklyn 3512 - 3514 Farragut Road Unit 1A 0525 Rent: $1,860 Household: 1 Person - 3 People Units: 1-Bedroom Bronx 950 Ogden Avenue Apartments - 1025 Unit 3C Rent: $2,660 Household: 1 Person - 2 People Units: Studio Brooklyn 1120 St Johns Place Multiple Units 0925 Rent: $1,904.99 - $2,381.23 Household: 1 Person - 3 People Units: 1-Bedroom Queens 65-25 Roosevelt Avenue Unit 2B 1125 Rent: $1,800 Household: 1 Person - 3 People Units: 1-Bedroom Queens 17-11 Hancock Street Apartments - Unit 5A Rent: $2,700 Household: 1 Person - 3 People Units: 1-Bedroom Bronx 1306 Findlay Avenue Apartments - 1025 Multiple Units Rent: $2,706 - $2,991 Household: 1 Person - 5 People Units: 1-Bedroom - 2-Bedroom Brooklyn 853 Lexington Avenue Unit 4B 1025 Rent: $3,270.22 Household: 2 People - 5 People Units: 2-Bedroom Brooklyn 1800 Ocean Avenue Unit 2D 1025 Rent: $3,227.6 Household: 2 People - 5 People Units: 2-Bedroom Brooklyn 131 Concord Street Apartments - 1025 Multiple Units Rent: $3,835.66 Household: 2 People - 5 People Units: 2-Bedroom Brooklyn 22 Chapel Street -Multiple Units 0625 Rent: $2,307 - $2,500.96 Household: 1 Person - 2 People Units: Studio Queens THE AURA - 1125 Unit 33G Rent: $4,376 Household: 2 People - 5 People Units: 2-Bedroom Bronx 629 East 222nd Street - Unit 2F 0825 Rent: $1,837.5 Household: 1 Person - 3 People Units: 1-Bedroom Brooklyn 3506 Farragut Road Unit 1A 0725 Rent: $1,911.15 Household: 1 Person - 3 People Units: 1-Bedroom Brooklyn 141 UTICA AVENUE APARTMENTS - 1025 UNIT 3R Rent: $2,428.03 Household: 3 People - 7 People Units: 3-Bedroom Brooklyn 461 Winthrop Street Unit 4C 0925 Rent: $1,956.07 Household: 1 Person - 3 People Units: 1-Bedroom Manhattan 320 West 135th Street Apartments 0725- Unit 2B Rent: $3,431.96 Household: 2 People - 5 People Units: 2-Bedroom",
  "https://mgnyconsulting.com/listings/": "Listings 12 results Household Income All $0 - $50,000 $50,000 - $100,000 $100,000 - $150,000 $150,000+ 2010 Walton Avenue Apartments 2010 Walton Avenue, Bronx, NY 10453 $59,936 - $147,420 1 Unit 235 Hawthorne Street 235 Hawthorne St, Brooklyn, NY 11225 $79,921 - $189,540 1 Unit 3573 Laconia Avenue 3573 Laconia Avenue, Bronx NY 10469 $85,511 - $168,480 1 Unit 3436 Kingsbridge Road 3436 Kingsbridge Avenue, Bronx, NY, 10463 $88,868 - $189,540 1 Unit 186 East 205 Street 186 East 205 street, Bronx, NY, 10458 $43,200 - $168,480 1 Unit 615 Saint John’s Place 615 Saint Johns Place, Brooklyn, NY, 11238 $92,422 - $189,540 1 Unit 2278 Bronx Park East 2278 Bronx Park East, Bronx, NY, 10467 $42,480 - $227,500 Astoria West 11-12 30th Dr, Astoria, NY 11102 $86,229 - $189,540 Lincoln at Bankside 101 Lincoln Ave, Bronx, NY, 10454 $103,258 - $261,170 Affordable Housing Property Tax Management Address 109 East 9th Street, Ground Floor",
  "https://ibis.powerappsportals.com/": "Re-Rentals Toggle navigation Available Rentals Affordable Studio Apartment - 1034 Kelly Street Recently built studio in Hunts Point, Bronx, featuring an open layout, modern finishes, and plenty of natural light. Located in a well-maintained building with secure entry, close to parks, shops, and public transportation. A great option for affordable and contemporary living in a vibrant neighborhood. Apply Now 446 Cyrus Place 1-Bedroom Apartment Bright 1-bedroom apartment at 446 Cyrus Place, just minutes from Fordham University, Arthur Avenue, and nearby parks. This home features a modern layout with a full kitchen, great natural light, and is in a well-maintained building close to shopping, dining, and public transportation. Apply Now Luxury 1-bed Apartment - 1015 E Gun Hill Road Modern 1-bedroom apartment available at 1015 E Gun Hill Road in the Bronx. This newly built building features an elevator, on-site laundry, and comfortable living in a convenient location. Don’t miss the chance to apply for this fresh, move-in ready home! Apply Now Convenient 1-bed Apartment - 2325 Beaumont Avenue Live comfortably at 2325 Beaumont Avenue, perfectly situated near local schools, shopping, and dining. With easy access to the 2 and 5 subway lines, residents enjoy seamless connections throughout the city while being part of a vibrant, welcoming Bronx community. Apply Now Penthouse Studio - 967 East 167th Street Discover this bright studio apartment at 967 East 167th Street in Crotona Park East — a comfortable, modern space perfect for city living. Enjoy an efficient layout, updated finishes, and close proximity to the 2, 5, and 6 trains, neighborhood shops, and parks. Ideal for anyone seeking convenience and comfort in the heart of the Bronx. Apply Now",
  "https://east-village-homes-owner-llc.rentcafewebsite.com/": "(646) 970-6802 Amenities Floor Plans Map Contact Us Application Form Income Limits Welcome to the EAST VILLAGE HOMES property website. Applications are now being accepted to fill East Village Homes vacancies and replenish the waiting list. This building was constructed through the Neighborhood Construction Program and Inclusionary Housing Program of the New York City Housing Development Corporation and the New York City Department of Housing Preservation and Development. Individuals or households who meet the income and household size requirements listed in the table may apply. Qualified applicants will be required to meet additional selection criteria such as asset limits. No application fee. No broker's fee. Smoke-Free Building. To apply online Applicant Portal To request an application by Click here to go back to Stanton Norfolk Inc. homepage. This property is managed by Stanton Norfolk, Inc. apartment search Beds Studio"
}