{
  "https://www.nyc.gov/site/hpd/services-and-information/find-affordable-housing-re-rentals.page": "Select Affordable Housing Building and Land Development Services New Construction Financing Property Management Rental and Down Payment Assistance Report a Complaint Section 8 / Rental Subsidy Programs Wage and Labor Affordable Housing Building and Land Development Services New Construction Financing Property Management Rental and Down Payment Assistance Report a Complaint Section 8 / Rental Subsidy Programs Find Affordable Housing Re-Rentals New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. Affordable housing lotteries continue to be available through Housing Connect . This page will be periodically updated with links to resources for finding some affordable re-rentals and resales that become available outside Housing Connect. AffordableHousing.com Reminder: Affordable housing lotteries also continue to be available through",
  "https://cgmrcompliance.com/housing-opportunities-1": "Housing Opportunities PLEASE NOTE: **This is an SRO (single room occupancy) unit. It is one small room with a bathroom and no kitchen in the unit. There is a shared kitchen on each floor.**",
  "https://www.clintonmanagement.com/availabilities/affordable/": "Affordable - Clinton Management Skip to content Menu button About Capabilities Executive and Senior Management Team The Douglaston Companies Properties Availabilities Market Rate Affordable Residents Careers Contact Levine Builders Douglaston Development Affordable Clinton Management is proud to offer quality affordable housing across a range of properties. We are not currently accepting applications, and our waitlists are closed. For additional information or assistance, please contact our Affordable Housing team at cm_leasing@cmnyc.com or call our information line at (347) 287-3100. New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. No availabilities found. About Properties Careers Residents Contact Reasonable Accommodation Info NYS Housing and Anti Discrimination Notice 42-06 235th Street Douglaston, NY 11363 718.281.2400 Contact Us >> © 2025 Clinton Management. All Rights Reserved. Privacy Policy | Terms & Conditions twitter facebook-app-symbol instagram",
  "https://fifthave.org/re-rental-availabilities/": "Re-Rental Availabilities - Fifth Avenue Committee Contact Us Donate Re-Rental Availabilities Available Affordable Housing Units basis per HPD guidelines. New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. Apply for a Re-Rental Unit! Current Units Available for Re-Rental The Axel - 539 Vanderbilt Avenue, Brooklyn NY Unit 3F Unit Size: Studio Household Size: 1-2 people AMI: 130% Rent: $2,723.32 Min Income: $96,950 Max Income: $168,480 3 Eleven 11th Avenue, Brooklyn NY Unit 617 Unit Size: 1 bedroom Household Size: 1-3 people AMI: 40% Rent: 763.23 Min Income: 29,905.03 Max Income: 58,320 111 Varick Street, Manhattan NY Unit 20F Unit Size: Studio Household Size: 1-2 people AMI: 70% Rent: 1,260.72 Min Income: 46,516.11 Max Income: 90,720 Apply for a Re-Rental Unit!",
  "https://ihrerentals.com/": "Photo Gallery Photo Gallery Affordable Apartment Rentals & Homes await you! Affordable Apartment Rentals & Homes await you! Affordable Apartment Rentals & Homes await you! Affordable Apartment New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move Featured New Rentals Discover Your New Rental At Ihrerentals.com, we specialise in processing your rental application for NYC Housing Opportunities from NYC HPD and NYC HDC. INFINITE HORIZONS ( “Ih”) is an HPD-approved Marketing Agent, is currently marketing the following affordable housing re-rental and re-purchase opportunities. All applications are reviewed and processed on a first-come, first-served basis in accordance with HPD guidelines. Home Purchases Opportunities Buy your new home At Ihrerentals.com, we specialise in processing your purchase application for NYC Housing Opportunities from NYC HPD and NYC HDC. This site is protected by reCAPTCHA and the Google and apply.",
  "https://kgupright.com/": "Contact Us Vacancies Request Application Contact Us Vacancies Request Application Contact Us Vacancies Request Application Contact Us Vacancies Request Application Contact Us ↓ Questions or Concerns? Need help marketing your rental property? Send us a message! This site is protected by reCAPTCHA and the Google and apply.",
  "https://www.langsampropertyservices.com/affordable-rental-opportunities": "Affordable Rental Opportunities Forms Team Affordable Rental Opportunities Affordable housing for rent: 603 Pontiac Place unit #3C, Bronx NY 10455 1 bedroom apartment, 1 bathroom apartment, 538 sqft Rent $1,362.00 Amenities: Roof Terrace, Bicycle Storage, Elevator, Laundry Room (* additional fees apply) Transit: Trains: 2/5; Buses: Bx42, Bx40, Bx4A Unit Size 80% AREA MEDIAN INCOME (AMI) UNITS Monthly Rent Units Available Household Size Annual Household Income Minimum - Maximum 1 bedroom $50,434 - $90,720 2 people $50,434 - $103,680 3 people $50,434 - $116,640 Tenant is responsible for electricity Household size includes everyone who will live with you, including parents and children. Subject to occupancy criteria. Household earnings includes salary, hourly wages, tips, Social Security, child support, and other income. Income guidelines subject to change. Minimum income listed may not apply to applicants with Section 8 or other qualifying rental subsidies. Asset limits also apply For more information or to apply: Enter Your First Name Enter Your Last Name Enter Your Email Address Enter Your Phone Number Comments Our Location When Mark Engel joined the organization in the mid 1970s, it managed 2,500 housing units. Langsam is designated as an Accredited Management Organization (AMO), a standard of excellence in management conferred by the Chicago-based, Institute of Real Estate Management (IREM). Langsam is one of only two AMO's in all of New York State which has four Certified Property Managers directing its property management teams. All of Langsam's managing agents are either Licensed Associate Real Estate Brokers or Sales Associates. Several are experienced in construction and design. Other professional staff have almost fifty years combined property management and support experience. Its Director of Operations holds a CPM designation and other staff hold advanced degrees in public finance and urban planning. Staff also have held high level positions in New York City government Langsam Property Services does not discriminate based on race, color, religion, national origin, sex, disability, familial status (minor children under the age of 18), age, sexual orientation, marital status, military status, lawful source of income (including housing voucher programs), gender identity or expression, arrest records, veteran status, and domestic violence victim status. FIND US ON MAP Tel: (718) 518-8000 / Fax: (718) 518-8585 Affordable Rental Opportunities",
  "https://mgnyconsulting.com/listings/": "Listings 12 results Household Income All $0 - $50,000 $50,000 - $100,000 $100,000 - $150,000 $150,000+ Affordable Housing Property Tax Management Address 109 East 9th Street, Ground Floor",
  "https://www.mickigarciarealty.com/": "FAQ Services How to Apply VICTORIA TOWER Known as “Harlem’s Tallest Building,” this 417,366-square-foot double-winged project consists of 191 units. The Victoria Tower is a new development project that utilizes the Housing Preservation & Development's lottery process. 152 EAST 116TH STREET, HDFC This redevelopment project is an incredible homeownership opportunity for those individuals & families looking to create a solid foundation for growth in this strong community. Located in the heart of East Harlem, steps from the 6 train and Sam’s Famous Pizzeria, this incredible building offers six newly renovated units for sale",
  "https://www.prontohousingrentals.com/": "Team NY + NYC Affordable Housing Availabilities How Do You Apply? The easiest way to apply is online! Simply click the “Apply to…” button for any property you’re interested in. This is the fastest and preferred way to be added to a property’s waitlist. If you prefer a paper application ( one application per property self-addressed envelope so a confirmation is sent back to you. If you want to apply to , you must clearly write the name of each property on the application. What Happens After You Submit Your Application? in the order they are received If you appear to meet the basic eligibility requirements, you will be contacted to provide documents that verify: Household size Identity of all household members Household income Disclaimer: Submitting an application in no way guarantees an apartment. Images should be deemed unreliable. The information below is for general browsing information only and should not be assumed as accurate. Available Units iconic luxury living With award-winning architecture by Bjarke Ingles Group (BIG) and original works of art, VIA 57 WEST sets a new standard of excellence in luxurious urban living. *Actual rent varies based on lease terms. The NYC Rent Guidelines Board approved rent increases for rent-stabilized apartments of 3% for one-year leases commencing on or after October 1, 2025, and on or before September 30, 2026, and 4.5% for two-year leases commencing on or after October 1, 2025, and on or before September 30, 2026. Tenant is responsible for electricity and rent includes gas for cooking. New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. Units available: 1809 120% studio 1-2 people Rent: $2,037.59 - $2,067.26* Min income: $73,152 - $74,169 Max income: $136,080 (household size of 1) or $155,520 (household size of 2) Apply to VIA Phase II The Larstrand - 227 W 77th St, New York, NY 10024 Turn your every day into an exemplary day at The Larstrand. Tucked away in a boutique-style building on the Upper West Side in New York, these studio, one, two, and three bedroom apartments exude style and luxury. Come home from a bustling day in the city and relax in the comforts provided by your new pet-friendly home. From high-end finishes and incredible in-home features to an outstanding array of community offerings, you’ll experience what comfort is – and we think you’re going to like it. The Larstrand is like nothing else. See for yourself. *Actual rent varies based on lease terms. The NYC Rent Guidelines Board approved rent increases for rent-stabilized apartments of 3% for one-year leases commencing on or after October 1, 2025, and on or before September 30, 2026, and 4.5% for two-year leases commencing on or after October 1, 2025, and on or before September 30, 2026. If approved, you will be offered both rent amounts and lease options to choose from. Tenant is responsible for electricity.New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. Units available: 04E - 40% 1-bedroom 1-3 people Rent: $962.24 - $976.25* Min income: $36,728 - $37,209* Max income: $45,360 (household size of 1), $51,840 (household size of 2), or $58,320 (household size of 3) Apply to The Larstrand Hoyt & Horn - 45 Hoyt Street Brooklyn, NY 11201 Take a break from it all. All right here. With places to hang on three floors, enjoy your own co-working space, fitness center, yoga studio, lounge and game room. There’s plenty of outdoor space to enjoy too, including a courtyard complete with a gaming lawn, loungers, and landscaped terrace. The roof is perfect for grillin’ and chillin’ with multiple dining areas, sun loungers, TV and panoramic views. **Actual rent varies based on lease terms. The NYC Rent Guidelines Board approved rent increases for rent-stabilized apartments of 3% for one-year leases commencing on or after October 1, 2025, and on or before September 30, 2026, and 4.5% for two-year leases commencing on or after October 1, 2025, and on or before September 30, 2026. If approved, you will be offered both rent amounts and lease options to choose from. Tenant is responsible for electricity. New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. Units available: 07A - 60% studio 1-2 people Rent: $1,141.89 - $1,158.52* Min income: $42,442 - $43,012* Max income: $68,040 (household size of 1) or $77,760 (household size of 2) 12W- 60% studio 1-2 people Rent: $1,114.03 - $1,130.25* Min income: $41,487 - $42,043* Max income: $68,040 (household size of 1) or $77,760 (household size of 2) 04B - 60% 1-bedroom 1-3 people Rent: $1,173.15 - $1,190.23* Min income: $43,959 - $44,545* Max income: $68,040 (household size of 1), $77,760 (household size of 2), or $87,840 (household size of 3) 07J - 60% 1-bedroom 1-3 people Rent: $1,278.35 - $1,296.97* Min income: $47,566 - $48,205* Max income: $68,040 (household size of 1), $77,760 (household size of 2), or $87,840 (household size of 3) 10F - 60% 1-bedroom 1-3 people Rent: $1,265.60 - $1,284.03* Min income: $47,129 - $47,761* Max income: $68,040 (household size of 1), $77,760 (household size of 2), or $87,840 (household size of 3) Apply to Hoyt & Horn Alexander Crossing 57 Alexander St., Yonkers, NY 10701 Alexander Crossing delivers brand-new apartment living on the Hudson River waterfront in Downtown Yonkers, a city abuzz with new energy. From our contemporary studio, one, two, and three bedroom layouts to our amenity-rich community, this is the lifestyle you crave. The vibrancy, agency, and quality of Alexander Crossing are reflected in our convenient location where dining, transportation, employment, and entertainment options are as plentiful as they are accessible. Units available: Unit 0702: 40%-65% 1 Bedroom 1-3 people Rent: Varies. Based according to 30% of the gross income for the household. Max income: $77,350 (household size of 1), $88,400 (household size of 2), or $99,450 (household size of 3) Units 0562, 0634, and 0762: 81% - 100% Studio 1-2 people Rent: Varies. Based according to 30% of the gross income for the household.* Max income: $119,000 (household size of 1), or $136,000 (household size of 2) Units 0246, and 0632: 81% -100% 1 Bedroom 1-3 people Rent: Varies. Based according to 30% of the gross income for the household.* Max income: $119,000 (household size of 1), $136,000 (household size of 2), or $153,000 (household size of 3) Unit 0670 - 81% - 100% 2 Bedroom 2- 5 people Rent: Varies. Based according to 30% of the gross income for the household.* Max income: $136,000 (household size of 2), $153,000 (household size of 3), $170,000 (household size of 4), or $183,000 (household size of 5) Apply to Alexander Crossing 7W21 - 7 West 21st Street, New York, NY 10010 Amidst the lively atmosphere of the historic Flatiron District are rental residences designed by Morris Adjmi. 7 West 21st Street blends classic architectural exteriors with chic modern interiors to create a unique living experience. The serene lobby is an oasis and features a beautiful sunken garden as its centerpiece. *Actual rent varies based on lease terms. The NYC Rent Guidelines Board approved rent increases for rent-stabilized apartments of 3% for one-year leases commencing on or after October 1, 2025, and on or before September 30, 2026, and 4.5% for two-year leases commencing on or after October 1, 2025, and on or before September 30, 2026. If approved, you will be offered both rent amounts and lease options to choose from. Tenant is responsible for electricity. New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. Units available: Units available: 04K - 60% studio 1-2 people Rent: $1,045.66 - $1,060.88* Min income: $39,142 - $39,665 Max income: $68,040 (household size of 1) or $77,760 (household size of 2) 07I - 60% 1-bedroom 1-3 people Rent: $1,148.47 - $1,165.20* Min income: $43,113 - $43,687* Max income: $68,040 (household size of 1), $77,760 (household size of 2), or $87,840 (household size of 3) 1008 - 60% 1-bedroom 1-3 people Rent: $1,125.86 - $1,142.26* Min income: $42,338 - $42,900* Max income: $68,040 (household size of 1), $77,760 (household size of 2), or $87,840 (household size of 3) 1708 - 60% 1-bedroom 1-3 people Rent: $1,050.60 - $1,065.90* Min income: $39,758 - $40,282* Max income: $68,040 (household size of 1), $77,760 (household size of 2), or $87,840 (household size of 3) Apply to 7W21 caesura means a pause in the middle of a line. In the middle of the Brooklyn Cultural District, Caesura means a carefully composed residence that’s a refuge from the city—as well as a place that provides effortless connection to nature, culture, community, and conscientious living. *Actual rent varies based on lease terms. The NYC Rent Guidelines Board approved rent increases for rent-stabilized apartments of 3% for one-year leases commencing on or after October 1, 2025, and on or before September 30, 2026, and 4.5% for two-year leases commencing on or after October 1, 2025, and on or before September 30, 2026. If approved, you will be offered both rent amounts and lease options to choose from. Tenant is responsible for electricity. New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. Units available: 1003 - 130% studio 1-2 people Rent: $1,647.85 - $1,671.84* Min income: $59,789 - $60,612* Max income: $147,420 (household size of 1) or $168,480 (household size of 2) 1205 - 130% 2 bedroom 2-5 people Rent: $2,880.97 - $2,22.93* Min income: $103,713 - $105,152* Max income: $168,480 (household size of 2), $189,540 (household size of 3), $210,600 (household size of 4), or $227,500 (household size of 5) Apply to Caesura EŌS Phase II 100 W. 31st St., New York NY 10001 EŌS offers distinctive residences, curated amenities and the personalized service necessary to experience New York City life to the fullest - inside and out. *Actual rent varies based on lease terms. The NYC Rent Guidelines Board approved rent increases for rent-stabilized apartments of 3% for one-year leases commencing on or after October 1, 2025, and on or before September 30, 2026, and 4.5% for two-year leases commencing on or after October 1, 2025, and on or before September 30, 2026. If approved, you will be offered both rent amounts and lease options to choose from. Tenant is responsible for electricity.New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. Units available: 38E - 130% studio 1-2 people Rent: $1,840.47 - $1,867.27* Min income: $66,393 - $67,312* Max income: $136,080(household size of 1) or $155,520 (household size of 2) Apply to EOS Phase II SVEN - 29-59 Northern Blvd, Astoria, NY 11101 Sven is the first multi-family residential building in the world to achieve LEED v4 New Construction (BD+C) Platinum certification, the highest attainable level. It is the first residential building in New York City where residents will have the ability to light up the skyline with the Spireworks mobile app. *Actual rent varies based on lease terms. The NYC Rent Guidelines Board approved rent increases for rent-stabilized apartments of 3% for one-year leases commencing on or after October 1, 2025, and on or before September 30, 2026, and 4.5% for two-year leases commencing on or after October 1, 2025, and on or before September 30, 2026. If approved, you will be offered both rent amounts and lease options to choose from. Tenant is responsible for electricity.New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. Units available: 130% studio - 1 unit available 1-2 people Rent: $2,254.67 - $2,350.41* Min income: $80,594 - $83,877 Max income: $147,420 (household size of 1) or $168,480 (household size of 2) 130% 1 bedroom - 6 units available 1-3 people Rent: $2,415.35 - $2,896.74* Min income: $86,549 - $103,054* Max income: $147,420 (household size of 1), $168,480 (household size of 2) or $189,540 (household size of 3) 130% 2 bedroom - 1 unit available 2-5 people Rent: $3,427.84 - $3,477.76* Min income: $122,463 - $124,175* Max income: $168,480 (household size of 2), $189,540 (household size of 3), $210,600 (household size of 4) or $227,500 (household size of 5) Apply to Sven",
  "https://sbmgmt.sitemanager.rentmanager.com/RECLAIMHDFC.aspx": "RECLAIM HDFC RECLAIM HDFC No broker’s fee, and this is a smoke-free building. All Walk-up Buildings (No Elevator) Application Period : Applications Accepted Click HERE for Application",
  "https://ahgleasing.com/": "LOW INCOME HOUSING OPPORTUNITIES Abington House at 500 W. 30th Street, New York, NY 10001 The Easton at 205 E. 92nd Street, New York, NY 10128 MIDDLE INCOME HOUSING OPPORTUNITY 553W30 is only accepting application requests for applicants with",
  "https://residenewyork.com/property-status/open-market/": "Listings Property Status Open For Application The Bronx Staten Island How To Apply A Step By Step Guide What Happens Next Apply For Your New Home With Ease Developer FAQs Contact Us Address: 349 Keap Street Listings Property Status Open For Application The Bronx Staten Island How To Apply Reside New York Exclusive Sales Min household Size Any 1 & 1/2 Months Of Free Rent (1) 1 Month Of Free Rent (1) 10th Floor Lounge (1) 17th Floor Lounge 24-hour Concierge (4) 6th Floor Recreation Balcony Or Patio (1) Balcony(Not Available To All Units) Dishwasher (62) Dishwasher In Unit Dishwashers (22) Dishwashers In Unit Fitness Center (13) Floor Spaces (1) Floor To Ceiling Windows Laundry (4) Laundry In Building Online Options For Leasing (5) Online Options For Leasing And Paying Rent Parking Space (2) Parking Spots Available Patio Or Balcony (261) Patio Or Balcony (varies By Unit) Private Terrace (6) Professionally Managed Building Rooftop (77) Rooftop Cinema (additional Fees Apply) Spa (42) Split Unit Heating And Cooling Split Units (2) Split-unit Heat/AC Study Room (1) Super Lives In Building Washer/Dryer (16) Washers And Dryer Hookup In Every Unit (2) Washers And Dryers Hookup In Unit Yoga (7) Yoga Studio (1) Yoga/Dance Studio Date New to Old View Property 2061 Crotona Avenue Apartments – Unit 7C Welcome to 2061 Crotona Avenue Apartments – Unit 7C … Affordable Units Available Unit Available $4,342 Per Month View Property 2061 Crotona Avenue Apartments – Unit 5A Welcome to 2061 Crotona Avenue Apartments – Unit 5A Click… Affordable Units Available Unit Available $4,217 Per Month View Property Flushing Preservation | 137-20 45th Avenue Apartment – Unit 2X Welcome to Flushing Preservation | 137-20 45th Avenue Apartment… Affordable Units Available Unit Available Open Market $950 Per Month View Property 3405 Farragut Road Apartment – Unit 4A Welcome to 3405 Farragut Road… Affordable Units Available Unit Available $2,416 Per Month View Property 210 West 150th Street Apartment – Unit 2E Welcome to Dunbar Apartments |… Affordable Units Available Unit Available $2,600 Per Month View Property Flushing Preservation | 137-20 45th Ave Apartment – Unit 4H Welcome to Flushing Preservation |… Affordable Units Available Unit Available $3,081 Per Month View Property Dutch House | 37-05 30th Street Apartment – Unit 318 Welcome to Dutch House |… Affordable Units Available Unit Available $2,779 Per Month View Property 1499 Bedford Avenue Apartment – Unit 5G Welcome to 1499 Bedford Avenue… Affordable Units Available Unit Available $3,698 Per Month View Property 56 W 125 St Apartment – Unit 1105 Welcome to 56 W 125 St Apartment –… Affordable Units Available Unit Available $3,003 Per Month View Property 1546 Jesup Ave Apartment – Unit 2B Welcome to 1546 Jesup Ave… Affordable Units Available Unit Available $2,778 Per Month View Property 2175 Bergen Street Apartment – Unit 3A Welcome to 2175 Bergen Street Apartment –… Affordable Units Available Unit Available $1,076 Per Month View Property Dunbar Apartments | 210 West 150th Street Apartment – Unit 1E Welcome to Dunbar Apartments |… Affordable Units Available Unit Available $2,262 Per Month View Property 370 East 158th Street Apartment – Unit 5A Welcome to 370 East 158th… Affordable Units Available Unit Available $2,862 Per Month View Property 1134 Fulton Street Apartment – Unit 3T Welcome to 1134 Fulton Street… Affordable Units Available Unit Available $2,327 Per Month View Property 2 Blue Slip Apartment – Unit 24N Welcome to 2 Blue Slip… Affordable Units Available Unit Available $2,508 Per Month View Property 2067 Anthony Avenue Apartments – Unit 802 Welcome to 2067 Anthony Avenue… Affordable Units Available Unit Available $3,250 Per Month View Property Dunbar Apartments | 231 West 149th Street Apartment – Unit 6E Welcome to Dunbar Apartments |… Affordable Units Available Unit Available $1,927 Per Month View Property 2829 Snyder Apartment – Unit 4A Welcome to 2829 Snyder Apartment… Affordable Units Available Unit Available $1,905 Per Month View Property Dunbar Apartments | 227 West 149th Street Apartment – Unit 3F Welcome to Dunbar Apartments |… Affordable Units Available Unit Available $2,262 Per Month View Property 137-20 45th Avenue Apartment – Unit 7K Welcome to Flushing Preservation |… Affordable Units Available Unit Available Click here to view the advertisement Click here to download… Bedrooms Household Size Of 1-6 Area Units Available Closed Project $2,253 - $3132 Bedrooms Area Affordable Units Available Welcome to 127 Boerum Street. Bedrooms Household Size of 2-6 Area Affordable Units Available Closed Project $2,350 - $2450 How To Apply Listings Property Status Open For Application The Bronx Staten Island How To Apply",
  "https://riseboro.org/housing/woodlawn-senior-living/": "Contact Us Join Us Annual Report Onsite Supportive Services Property Management Rental Assistance Program (ERAP) Onsite Supportive Services Property Management Rental Assistance Program (ERAP) Woodlawn Senior Living Description: Affordable, Social Services, built to passive house standards. Ground floor preschool facility with outdoor play area. We are currently accepting applications for brand-new affordable apartments through the Project-Based Voucher (PBV) Section 8 Program. This community has been designed with comfort, accessibility, and long-term affordability in mind. Program & Eligibility These apartments are reserved for individuals or households where at least one member is age 62 or older at the time of application. Eligibility is determined by both age and household size, as well as income limits. Applicants must qualify for Section 8 housing assistance. Rent is calculated at 30% of household income, as determined by Section 8 guidelines, and includes utilities. Maximum annual household income to apply: $56,700. This building is part of the Senior Affordable Rental Apartments (SARA) Program and supported through the HOME Investment Partnerships Program (HOME) of the New York City Department of Housing Preservation and Development. What You’ll Need to Apply While requirements may vary from household to household, applicants should be prepared to provide: Proof of income for all household members Valid identification for each resident Documentation verifying household size and eligibility No application fees or deposits are required Applicants selected will also undergo program verification to confirm Section 8 eligibility. Advantages & Amenities This thoughtfully designed building provides a safe, welcoming, and convenient environment for seniors. Amenities include: – Shared laundry room with card-operated machines – Dedicated storage space for residents – Elevator access throughout the building – Convenient access to public transportation (bus stop nearby) – Outdoor common areas to relax and enjoy fresh air -Free parking is available through a lottery system, with electric vehicle charging offered at applicable rates. How to Apply Applying is simple and can be done in one of two ways: Click Here to Print Application Contact Us Join Us Annual Report Onsite Supportive Services Property Management Rental Assistance Program (ERAP) Volunteer Program Social RiseBoro Community Partnership is an equal opportunity employer/program. Auxiliary aids and services are available upon request to individuals with disabilities. TTY Telephone Number is",
  "https://www.sjpny.com/affordable-rerentals": "Affordable Re-Rentals Employee Portal AVAILABLE AFFORDABLE HOUSING RE-RENTALS SJP Tax Consultants Inc is an HPD-approved Marketing Agent. Qualified applicants will be required to meet income guidelines and additional selection criteria. No Broker's Fee. No Application Fee. Current tenants may have priority for available rentals under certain circumstances and at sole discretion of owner/management. Submitting an application in no way guarantees an apartment. basis, for re-rentals, per HPD guidelines. Applicant’s are processed in first-come, first-served order and/or according to the Marketing Agent’s written procedures regarding waitlists or internal transfers. 1 - Available Re-Rental Apartment in Astoria, Queens Between 28th/29th Street and Astoria Boulevard Bedroom Size - 1 Bedroom Household Size - 1 -3 people *Current Legal Rent Amount - $1,410.55 Approximate Income Limits (80% AMI): 1 person - $48,362 - $90,720 2 people - $48,362 - $103,680 3 people - $48,362 - $116,640 *Rent amount subject to change. For rent-stabilized apartments in New York City, the 2025–2026 lease renewal rent increases set by the NYC Rent Guidelines Board are as follows: 1-year lease renewal 3% increase 2-year lease renewal 4.5% increase These rates apply to leases commencing on or after October 1, 2025 and on or before September 30, 2026 Apartmented rented and waitlist met",
  "https://soisrealestateconsulting.com/current-projects-1": "CURRENT PROJECTS HOME COMPLETED PROJECTS CURRENT PROJECTS AFFORDABLE HOUSING PROPERTY MANAGEMENT VISION/MISSION THE TEAM PRIVACY POLICY More HOME COMPLETED PROJECTS CURRENT PROJECTS AFFORDABLE HOUSING PROPERTY MANAGEMENT VISION/MISSION THE TEAM PRIVACY POLICY HOME COMPLETED PROJECTS CURRENT PROJECTS AFFORDABLE HOUSING PROPERTY MANAGEMENT VISION/MISSION THE TEAM PRIVACY POLICY Current Projects Geel Webster Avenue Whitlock Point Phase 1 Whitlock Point Phase 1 See Project Whitlock Point Phase 1 Whitlock Point Phase 1 Whitlock Point Phase 1 See Project Geel Webster Avenue APLICATION DUE DATE - APRIL7,2025 3095 WEBSTER AVENUE Bronx, New York 10467 Get directions Download PDF WHITLOCK POINT APLICATION DUE DATE - APRIL7,2025 1001 Whitlock Avenue, Foxhurst, Bronx, New York 10459, EE. UU. Get directions Download PDF SOIS Copyright © 2023 Sois Maintenace LLC. All rights reserve. Powered by This website uses cookies This website uses cookies to improve user experience, functionality and performance. If you continue browsing the site, you consent to the use of cookies on this website. Note that you can change your browser/cookie settings at any time. To learn more about the use of cookies and how to adjust your settings, please OK, I agree",
  "https://springmanagement.net/apartments-for-rent/": "Apartments For Rent – Spring Leasing and Management Team Featured Projects Apartments For Rent Residents Apartments For Rent 516-665-0015 1488 New York Avenue Address: Buses Senior(s): At least one household member must be 62 years of age or older at time of application No application fee • No broker’s fee • Smoke free and Pet free building 1488 NEW YORK AVENUE UNIT(S) AVAILABLE AVAILABLE UNITS 321 E 60th Street Address: 321 East 60th Street New York, NY 10022 Amenities: Elevator, On-Site Laundry (coin operated), On-Site parking* (additional fees apply) & M100/ M101/ M102/ M103/ M57/M60/M98/M15 Buses No application fee • No broker’s fee • Smoke free and Pet free building 321 EAST 60TH STREET UNIT(S) AVAILABLE WAITING LIST RADROC Address: Street Far Rockaway, Queens, NY 11691 Amenities: Landscaped Terraces, Community Room, Bicycle Storage, Parking, On-Site Laundry* (additional fees apply) & Q22, Q113, Q114 and N31 Buses No application fee • No broker’s fee • Smoke free and Pet free buildings RADROC UNIT(S AVAILABLE WAITING LIST THE BEDFORD Address:3160 Webster Avenue Bronx, NY 10467 Amenities: Roof Deck, Bike room, On-Site Laundry room* (additional fees apply) Buses THE BEDFORD UNIT(S AVAILABLE",
  "https://sites.google.com/affordablelivingnyc.com/hpd/home": "basis per HPD guidelines. New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. Unit on Hold Bronx , NY Unit Size: 1 bedroom Household size: 1-3 Rent: $2,222.54 Mini Income: $85,595.66 Max Income: $148,420 - $189,540 Download application Unit on Hol 1270 New York Brooklyn, NY Unit Size: 1 bedroom Household size: 1-3 Rent: $2,329.13 Mini Income: $89,250.17 Max Income: $148,420 - $189,540 Download application Unit on Hol 2746 Fulton St Brooklyn, NY Unit Size: bedroom Household size: 2-5 Rent: $2,343.25 Mini Income: $94,842.86 Max Income: $168,480 - $227,500 Download application Unit on Hold Brooklyn , NY Unit Size: bedroom Household size: 1- Rent: $2,916.05 (Rent increase will apply upon lease signing.) Mini Income: $58,902.86 Max Income: $148,420 - $189,540 Download application Unit on Hold Brooklyn , NY Unit Size: 0-1 bedroom Household size: 1-2, 1-3 Rent: $633.59 , $876.49 , $904.97, $822.17, $832.90 (Rent increase will apply upon lease signing.) Mini Income: $25,014.51 $34,764.69 Max Income: $45,360 $72,900 Download application New York , NY Unit Size: 1 Bedroom Household size: 1- Rent: $2,467.39 (Rent increase will apply upon lease signing.) Mini Income: $91,933.37 Max Income: $148,420 - $ 189,540 Download application Units On hold 260 Kent Ave.-Unit 39B &43B Brooklyn , NY Unit Size: Studio Household size: 1- Rent: $2,614.50 $2,686.40 Mini Income: $94,782.86 $97,248.00 Max Income: $141,750 - $162,000 Download application Bonus photos! Unit Available! 148-37 88th Ave - Jamaica, NY Unit Size: 2 bedroom Household size: 2-5 Rent: $2,820.14 $2,861.21 Mini Income: $101,691.43 Max Income: $168,480 - $227,50 Get in touch with us to book a tour now! 718-650-657 Download application Unit Brooklyn , NY Unit Size: 1 bedroom Household size: 1-3 Rent: $3,191.97 (Rent increase will apply upon lease signing.) Mini Income: $115,645.71 Max Income: $148,420 - $189,540 Download application Unit Available! Broooklyn , NY Unit Size: Studio Household size: 1- Rent: $2,870.99 $2,912.80 Mini Income: $101,224.11 Max Income: $ 147,420- $168,480 Note: Vouchers would not cover this rent amount. Get in touch with us to book a tour now! 718-650-6570 Download application Bonus photos! Note, photos may not reflect the actual units and amenities. For illustration purpose only Submit Your Application How to Apply for Affordable Housing; To apply for any of our affordable housing units, please follow the steps below: Download the Application Form Complete the Application Mail the Completed Application To: Need help? Call us at: 718-650-6570 *Listings are updated regularly. Please apply early to be considered under HPD’s first-come, first-served policy. Tax Solute supports HPD-approved Marketing Agents in the marketing and intake of affordable housing units.*",
  "https://www.taxaceny.com/projects-8": "Available Units | Taxace NY Our Services Contact Us Available Units More... Use tab to navigate through the menu items. Vacant Available Units The following units are currently vacant and open for applications. Interested individuals are encouraged to apply.​ New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. 987 Willoughby Ave. Unit 4D Brooklyn, NY Unit Size: 1-bedroom Rent: $2,479.87 Utilities: Tenant's Responsibility Elevator Building: No Min Income: $82,548 - $189,540 Rent $2,479.87 Apply 103 Liberty Avenue. Unit 6F Brooklyn, NY Unit Size: 1-bedroom Rent: $2,706 Utilities: Tenant's Responsibility Elevator Building: Yes Min Income: $101,280 - $189,540 Rent $2,706 Apply 1464 Watson Avenue. Unit 506 Bronx, NY Unit Size: 1-bedroom Rent: $2,751 Utilities: Tenant's Responsiblity Elevator Building: Yes Min Income: $99,942 - $189,540 Rent $2,751 Apply 1678 Davidson Avenue. Unit 4C Bronx, NY Unit Size: Studio Rent: $2,660 Utilities: Tenant's Responsibility Elevator Building: No Min Income: $98,278 - $168,480 Rent $2,660 Apply 1678 Davidson Avenue. Unit 1B Bronx, NY Unit Size: Studio Rent: $2,660 Utilities: Tenant's Responsibility Elevator Building: No Min Income: $98,278 - $168,480 Rent $2,660 Apply 1688 East 18th Street Brooklyn, NY Unit Size: Studio Rent: $2,863 Utilities: Included in the Rent Elevator Building: Yes Min Income: $98,160 - $168,480 Rent $2,660 Apply 1668 Bergen Street. Unit Brooklyn, NY PENDING Apply Unit Size: 1-bedroom Rent: $2,706 Utilities: Tenant's responsibility Elevator Building: No Min Income: $101,280 - $189,540 Rent $2,706 CONTACT US LOCATION",
  "https://tfc.com/about/affordable-re-rentals": "TF Cornerstone",
  "https://www.thebridgeny.org/news-and-media": "Latest News Learn More Annual Reports Read More Latest News The Bridge Affordable Housing Re-Rental Studio apartment for senior (62+ years) available for rent at The Bridge's Multifamily Housing Building in Morrisania, Bronx Email for more information Application The Bridge Affordable Housing Re-Rental Units available for rent at The Bridge's Multifamily Housing Building in Brownsville, Brooklyn here to see flyer Application Read More Fast Company This Brooklyn apartment building offers an unexpected take on work from home JUNE 2024 Read More Annual Reports",
  "https://wavecrestrentals.com/section.php?id=1": "Wavecrest Website Currently not accepting applications. Qualified applicants will be required to meet income guidelines and additional selection criteria. Accepting application on an ongoing basis for anticipated vacancies. No Broker's Fee. No Application Fee. Rent levels and income requirement may vary among the buildings, but the following chart provides general guidelines and ranges. Units below are examples only. Actual unit availability will vary. Applications are vetted on a first come first serve basis. Current tenants may have priority for available rentals under certain circumstances and at sole discretion of management. All applications are placed on waiting lists. As some units and rents are more desirable than others, wait time will vary based on your preferences and your eligibility for certain units. Submitting an application in no way guarantees an apartment. Images are google street view and should be deemed unreliable. The information below is for general browsing information only and should not be assumed as accurate. Apt Size Monthly Rent Total Annual Income Range Min - Max Studio $803 - $1,928 $28,250 - $68,040 $28,250 - $77,760 1 Bed $800 - $2,414 $29,260 - $77,760 $29,260 - $87,480 2 Bed $910 - $2,590 $32,790 - $87,480 $32,790 - $97,200 $32,790 - $105,000 3 Bed $59,397- $87,480 $59,397 - $97,200 $59,397 - $105,000 $59,397 - $112,800 Rent subject to change Income guidelines subject to change",
  "https://yourneighborhoodhousing.com/": "Your Neighborhood Housing Your Neighborhood Housing Available Listings How to Apply FAQ More Available Listings How to Apply FAQ Available Listings How to Apply FAQ Find an Affordable Apartment Today Find an Affordable Apartment Today Find an Affordable Apartment Today Find an Affordable Apartment Today This site is protected by reCAPTCHA and the Google and apply. Connect With Us Sign up for updates on avalibility Email Address",
  "https://www.elhrerentals.com/": "ELH Re-Rentals Available Units Apply Now Open Menu Close Menu Available Units Apply Now Open Menu Close Menu Available Units Apply Now Available Properties Below is a list of properties currently accepting applications for vacant apartments The waitlist for has closed as of August 4, 2025. ELH is no longer accepting applications for Sea Park, as we are no longer the management agent for this development effective 10/31/2025. Please note that while your application will remain securely stored in our system, it will not be processed due to this change. La Central Renaissance at Lincoln Park ELH Mgmt. LLC is a full-service, solution-driven real estate company with unmatched expertise in building, acquiring, preserving and managing affordable housing throughout New York City. By transforming the built environment to create new housing opportunities, ELH seeks to empower the residents who call our properties home and stabilize the neighborhoods in which we operate. New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. © 2025 ELH MGMT. All rights reserved. Apply Now Learn more Address 1675 Broadway, 29th Floor (718) 855-5620 Email To Request an Application"
}