{
  "https://www.nyc.gov/site/hpd/services-and-information/find-affordable-housing-re-rentals.page": "Find affordable Housing Re-rentals - HPD Housing Preservation & Development 311 Search all NYC.gov websites Menu Text-Size Search Home About Services and Information Media Events Contact Search Search Affordable Housing Find Affordable Housing Re-Rentals Select Affordable Housing Building and Land Development Services Code Enforcement Compliance Design Guidelines Do Business with HPD Guide for NYC Homeowners Home Repair and Preservation Financing Housing Quality / Safety Neighborhood Planning New Construction Financing Property Management Rental and Down Payment Assistance Report a Complaint Section 8 / Rental Subsidy Programs Tenants' Rights Tax Credits and Incentives Wage and Labor Affordable Housing Building and Land Development Services Code Enforcement Compliance Design Guidelines Do Business with HPD Guide for NYC Homeowners Home Repair and Preservation Financing Housing Quality / Safety Neighborhood Planning New Construction Financing Property Management Rental and Down Payment Assistance Report a Complaint Section 8 / Rental Subsidy Programs Tenants' Rights Tax Credits and Incentives Wage and Labor Share Print Find Affordable Housing Re-Rentals New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. Affordable housing lotteries continue to be available through Housing Connect . This page will be periodically updated with links to resources for finding some affordable re-rentals and resales that become available outside Housing Connect. Affordable Re-Rentals Resources New York City Housing Development Corporation (HDC) New York State Homes and Community Renewal (HCR) Contact Affordable Housing properties and property managers to find out about vacancies. Affordable for New York CGMR Compliance City5 Clinton Management Fifth Avenue Committee iAfford Infinite Horizons Ibis Advisors K&G Upright Langsam Property Services MGNY Micki Garcia Realty Pronto Housing Reclaim HDFC Related Management Company Reside New York RiseBoro Riverton Square SJP Tax Consultants Inc. SOIS Spring Leasing and Management Stanton Norfolk Inc. Tax Solute Taxace NY TF Cornerstone The Bridge Wavecrest Rentals Your Neighborhood Housing You may also find listings for New York City affordable housing vacancies on sites like StreetEasy and AffordableHousing.com Reminder: Affordable housing lotteries also continue to be available through Housing Connect . nyc.gov home Services Events Your government 311 Contact NYC government Register to vote Emergency alerts Careers Website feedback Accessibility resources Privacy policy Terms of use About nyc.gov content NYC Search Search © City of New York. 2025 All Rights Reserved. NYC is a trademark and service mark of the City of New York.",
  "https://cgmrcompliance.com/housing-opportunities-1": "**This is an SRO (single room occupancy) unit. It is one small room with a bathroom and no kitchen in the unit. There is a shared kitchen on each floor.**",
  "https://www.clintonmanagement.com/availabilities/affordable/": "Affordable - Clinton Management Skip to content Menu button About Capabilities Executive and Senior Management Team The Douglaston Companies Properties Availabilities Market Rate Affordable Residents Careers Contact Levine Builders Douglaston Development Affordable Clinton Management is proud to offer quality affordable housing across a range of properties. We are not currently accepting applications, and our waitlists are closed. For additional information or assistance, please contact our Affordable Housing team at cm_leasing@cmnyc.com or call our information line at (347) 287-3100. New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. No availabilities found. About Properties Careers Residents Contact Reasonable Accommodation Info NYS Housing and Anti Discrimination Notice 42-06 235th Street Douglaston, NY 11363 718.281.2400 Contact Us >> © 2025 Clinton Management. All Rights Reserved. Privacy Policy | Terms & Conditions twitter facebook-app-symbol instagram",
  "https://fifthave.org/re-rental-availabilities/": "Available Affordable Housing Units Apply for a Re-Rental Unit! Current Units Available for Re-Rental Unit 3F Unit Size: Household Size: Rent: $2,723.32 $96,950 $168,480 Unit 617 Unit Size: 1 bedroom Household Size: Rent: Unit 20F Unit Size: Household Size: Rent: Apply for a Re-Rental Unit!",
  "https://ihrerentals.com/": "Affordable Apartment Affordable Apartment Affordable Apartment Affordable Apartment",
  "https://ibis.powerappsportals.com/": "Affordable Studio Apartment - 1034 Kelly Street 446 Cyrus Place 1-Bedroom Apartment Bright 1-bedroom apartment at 446 Cyrus Place, just minutes from Fordham University, Arthur Avenue, and nearby parks. This home features a modern layout with a full kitchen, great natural light, and is in a well-maintained building close to shopping, dining, and public transportation. Luxury 1-bed Apartment - 1015 E Gun Hill Road Modern 1-bedroom apartment available at 1015 E Gun Hill Road in the Bronx. This newly built building features an elevator, on-site laundry, and comfortable living in a convenient location. Don’t miss the chance to apply for this fresh, move-in ready home! Convenient 1-bed Apartment - 2325 Beaumont Avenue Discover this bright studio apartment at 967 East 167th Street in Crotona Park East — a comfortable, modern space perfect for city living. Enjoy an efficient layout, updated finishes, and close proximity to the 2, 5, and 6 trains, neighborhood shops, and parks. Ideal for anyone seeking convenience and comfort in the heart of the Bronx.",
  "https://kgupright.com/": "K&G Upright Consulting Home About Completed Projects Contact Us Vacancies Request Application Home About Completed Projects Contact Us Vacancies Request Application More Home About Completed Projects Contact Us Vacancies Request Application Home About Completed Projects Contact Us Vacancies Request Application Housing Marketing and Compliance Services Housing Marketing and Compliance Services Housing Marketing and Compliance Services Housing Marketing and Compliance Services Housing Marketing and Compliance Services With +20 years providing businesses with housing marketing, advertising, compliance, lotteries, certification and rentals. Contact Us ↓ Housing Marketing and Compliance Services Housing Marketing and Compliance Services Housing Marketing and Compliance Services Housing Marketing and Compliance Services Housing Marketing and Compliance Services With +20 years providing businesses with housing marketing, advertising, compliance, lotteries, certification and rentals. Contact Us ↓ Questions or Concerns? Need help marketing your rental property? Send us a message! K&G Upright Consulting New York, United States Drop us a line! Drop us a line! First Name + Last Name* Email* Phone Number This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Cancel Drop us a line! Join Our Mailing List Email Sign up Copyright © 2025 K&G Upright Consulting - All Rights Reserved. Powered by Home About Contact Us Privacy Policy Vacancies",
  "https://www.langsampropertyservices.com/affordable-rental-opportunities": "Affordable housing for rent: 603 Pontiac Place unit #3C, Bronx NY 10455 1 bedroom apartment, 1 bathroom apartment, 538 sqft Rent $1,362.00 Unit Size INCOME (AMI) UNITS Monthly Rent Units Available Household Size Annual Household Income 1 bedroom $1,362.00 $50,434 - $90,720 $50,434 - $103,680 $50,434 - $116,640 Household size includes everyone who will live with you, including parents and children. Subject to occupancy criteria. Household earnings includes salary, hourly wages, tips, Social Security, child support, and other income. Income guidelines subject to change. Langsam Property Services Corp. is a Bronx-based real estate management company. The company is responsible for managing the day-to-day operation of approximately 350 buildings containing over 11,000 dwelling units and 300 commercial units. These buildings are located in the Bronx, Manhattan, Queens, Brooklyn, and lower Westchester County. When Mark Engel joined the organization in the mid 1970s, it managed 2,500 housing units. Langsam is designated as an Accredited Management Organization (AMO), a standard of excellence in management conferred by the Chicago-based, Institute of Real Estate Management (IREM). Langsam is one of only two AMO's in all of New York State which has four Certified Property Managers directing its property management teams.",
  "https://www.mickigarciarealty.com/": "Known as “Harlem’s Tallest Building,” this 417,366-square-foot double-winged project consists of 191 units. Located in the heart of East Harlem, steps from the 6 train and Sam’s Famous Pizzeria, this incredible building offers six newly renovated units for sale",
  "https://sbmgmt.sitemanager.rentmanager.com/RECLAIMHDFC.aspx": "RECLAIM HDFC - Sycamore Birch Management Home About Us Services Contact RECLAIM HDFC RECLAIM HDFC No broker’s fee, and this is a smoke-free building. Transit information: Buildings Are Scattered All Walk-up Buildings (No Elevator) Application Period : Applications Accepted Tenant Selection : Not Started 2317-21 Tiebout Avenue, Bronx NY 2104 Crotona Pkwy, Bronx NY 1982 University Avenue, Bronx NY 2042 Grand Avenue, Bronx NY 503-505 East 180th Street, Bronx NY 314 East 183rd Street, Bronx NY 308 East 183rd Street, Bronx NY 2242 Valentine Avenue, Bronx NY 1821 University Avenue, Bronx NY 824 East 181st Street, Bronx NY Click HERE for Application Tenant Portal SBCO Portal Login © LCS 2025 - WTS",
  "https://ahgleasing.com/": "ACCESSIBILITY UNITS",
  "https://residenewyork.com/property-status/open-market/": "Min household Size 1 & 1/2 Months Of Free Rent 1 Month Of Free Rent Balcony(Not Available To All Units) Dishwasher In Unit Dishwashers In Unit Laundry In Units Microwave In The Units Online Options For Leasing And Paying Rent Patio Or Balcony (varies By Unit) Smoking Permitted In Units Split Unit Heating And Cooling Split Units Split-unit Heat/AC Washer And Dryer In Units Washer And Dryers In Units Washers And Dryer Hookup In Every Unit Washers And Dryers Hookup In Unit 210 West 150th Street Apartment – Unit 2E Affordable Units Available Unit Available $2,600 Per Month 2817 Atlantic Avenue Apartment – Unit 5D Affordable Units Available Unit Available $2,737 Per Month Flushing Preservation | 137-20 45th Ave Apartment – Unit 4H Affordable Units Available Unit Available $3,081 Per Month Dutch House | 37-05 30th Street Apartment – Unit 318 Affordable Units Available Unit Available $2,779 Per Month 1258 Shakespeare Apartment – Unit 304 Welcome to 1258 Shakespeare Apartment… Affordable Units Available Unit Available $2,924 Per Month 1499 Bedford Avenue Apartment – Unit 5G Affordable Units Available Unit Available $3,698 Per Month 56 W 125 St Apartment – Unit 1105 Welcome to 56 W 125 St Apartment –… Affordable Units Available Unit Available $3,003 Per Month 1546 Jesup Ave Apartment – Unit 2B Affordable Units Available Unit Available $2,778 Per Month 2175 Bergen Street Apartment – Unit 3A Welcome to 2175 Bergen Street Apartment –… Affordable Units Available Unit Available $1,076 Per Month Dunbar Apartments | 210 West 150th Street Apartment – Unit 1E Affordable Units Available Unit Available $2,262 Per Month 370 East 158th Street Apartment – Unit 5A Affordable Units Available Unit Available $2,862 Per Month 1134 Fulton Street Apartment – Unit 3T Affordable Units Available Unit Available $2,327 Per Month 2 Blue Slip Apartment – Unit 24N Affordable Units Available Unit Available $2,508 Per Month 2067 Anthony Avenue Apartments – Unit 802 Affordable Units Available Unit Available $3,250 Per Month Dunbar Apartments | 231 West 149th Street Apartment – Unit 6E Affordable Units Available Unit Available $1,927 Per Month 2829 Snyder Apartment – Unit 4A Welcome to 2829 Snyder Apartment… Affordable Units Available Unit Available $1,905 Per Month Dunbar Apartments | 227 West 149th Street Apartment – Unit 3F Affordable Units Available Unit Available $2,262 Per Month 137-20 45th Avenue Apartment – Unit 7K Affordable Units Available Unit Available $3,083 Per Month 130 Hope Street Apartment – Unit 108 Affordable Units Available Unit Available $3,012 Per Month 130 Hope Street Apartment – Unit 205 Affordable Units Available Unit Available $3,212 Per Month",
  "https://riseboro.org/housing/woodlawn-senior-living/": "These apartments are reserved for individuals or households where at least one member is age 62 or older at the time of application. Eligibility is determined by both age and household size, as well as income limits. Rent is calculated at 30% of household income, as determined by Section 8 guidelines, and includes utilities. Maximum annual household income to apply: $56,700. While requirements may vary from household to household, applicants should be prepared to provide: Proof of income for all household members Documentation verifying household size and eligibility Number of Units:",
  "https://www.sjpny.com/affordable-rerentals": "Current tenants may have priority for available rentals under certain circumstances and at sole discretion of owner/management. Submitting an application in no way guarantees an apartment. 1 - Available Re-Rental Apartment in Astoria, Queens Bedroom Size - 1 Bedroom Household Size - 1 -3 people *Current Legal Rent Amount - $1,410.55 1 person - $48,362 - $90,720 2 people - $48,362 - $103,680 3 people - $48,362 - $116,640 *Rent amount subject to change. For rent-stabilized apartments in New York City, the 2025–2026 lease renewal rent increases set by the NYC Rent Guidelines Board are as follows:",
  "https://soisrealestateconsulting.com/current-projects-1": "CURRENT PROJECTS HOME COMPLETED PROJECTS CURRENT PROJECTS AFFORDABLE HOUSING PROPERTY MANAGEMENT VISION/MISSION THE TEAM PRIVACY POLICY More HOME COMPLETED PROJECTS CURRENT PROJECTS AFFORDABLE HOUSING PROPERTY MANAGEMENT VISION/MISSION THE TEAM PRIVACY POLICY HOME COMPLETED PROJECTS CURRENT PROJECTS AFFORDABLE HOUSING PROPERTY MANAGEMENT VISION/MISSION THE TEAM PRIVACY POLICY Current Projects Geel Webster Avenue Whitlock Point Phase 1 Whitlock Point Phase 1 See Project Whitlock Point Phase 1 Whitlock Point Phase 1 Whitlock Point Phase 1 See Project Geel Webster Avenue APLICATION DUE DATE - APRIL7,2025 3095 WEBSTER AVENUE Bronx, New York 10467 Get directions Download PDF WHITLOCK POINT APLICATION DUE DATE - APRIL7,2025 1001 Whitlock Avenue, Foxhurst, Bronx, New York 10459, EE. UU. Get directions Download PDF SOIS Copyright © 2023 Sois Maintenace LLC. All rights reserve. Powered by This website uses cookies This website uses cookies to improve user experience, functionality and performance. If you continue browsing the site, you consent to the use of cookies on this website. Note that you can change your browser/cookie settings at any time. To learn more about the use of cookies and how to adjust your settings, please OK, I agree",
  "https://springmanagement.net/apartments-for-rent/": "Apartments For Rent – Spring Leasing and Management Apartments For Rent Apartments For Rent At least one household member must be 62 years of age or older at time of application 1488 NEW YORK AVENUE UNIT(S) AVAILABLE AVAILABLE UNITS 321 EAST 60TH STREET UNIT(S) RADROC UNIT(S UNIT(S",
  "https://east-village-homes-owner-llc.rentcafewebsite.com/": "are now being accepted to fill East Village Homes vacancies and replenish the waiting list. This building was constructed through the Neighborhood Construction Program and Inclusionary Housing Program of the New York City Housing Development Corporation and the New York City Department of Housing Preservation and Development. Individuals or households who meet the income and household size requirements listed in the table may apply. Qualified applicants will be required to meet additional selection criteria such as asset limits. No application fee. No broker's fee. Smoke-Free Building. apartment search",
  "https://sites.google.com/affordablelivingnyc.com/hpd/home": "Available Affordable Housing Units Unit on Hold Unit Size: 1 bedroom Household size: 1-3 Rent: $2,222.54 $85,595.66 Max Income: $148,420 - $189,540 Unit on Hol Unit Size: 1 bedroom Household size: 1-3 Rent: $2,329.13 $89,250.17 Max Income: $148,420 - $189,540 Unit on Hol Unit Size: bedroom Household size: Rent: $2,343.25 $94,842.86 Max Income: $168,480 - $227,500 Unit on Hold Unit Size: bedroom Household size: 1- Rent: $2,916.05 (Rent increase will apply upon lease signing.) Mini Income: $58,902.86 Max Income: $148,420 - $189,540 Unit on Hold Unit Size: bedroom Household size: 1-2, 1-3 Rent: $633.59 , $876.49 , $904.97, $822.17, $832.90 (Rent increase will apply upon lease signing.) $25,014.51 $34,764.69 $45,360 $72,900 Unit on Hold Unit Size: 1 Bedroom Household size: 1- Rent: $2,832.32 (Rent increase will apply upon lease signing.) $106,502.40 Max Income: $148,420 - $ Units On hold 260 Kent Ave.-Unit 39B &43B Unit Size: Household size: 1- Rent: $2,614.50 $2,686.40 $94,782.86 $97,248.00 $141,750 - $162,000 Unit Available! Unit Size: 2 bedroom Household size: 2-5 Rent: $2,820.14 $2,861.21 $101,691.43 Max Income: $168,480 - $227,500 Unit Unit Size: 1 bedroom Household size: 1-3 Rent: $3,191.97 (Rent increase will apply upon lease signing.) $115,645.71 Max Income: $148,420 - $189,540 Unit Unit Size: Household size: 1- Rent: $2,870.99 $2,912.80 $101,224.11 147,420- $168,480 Note: Vouchers would not cover this rent amount. Note, photos may not reflect the actual units and amenities. For illustration purpose only Unit Available! Unit Size: 2 bedroom Household size: 2-5 Rent: $2,928.07 Rent increase will apply upon lease signing.) $110,608.11 Max Income: $168,480 - $227,500 Note: Vouchers would not cover this rent amount. To apply for any of our affordable housing units, please follow the steps below: Please note: some units might also be listed on alternative platforms. *Listings are updated regularly. Please apply early to be considered under HPD’s first-come, first-served policy. Tax Solute supports HPD-approved Marketing Agents in the marketing and intake of affordable housing units.*",
  "https://www.taxaceny.com/projects-8": "Available Units | Taxace NY Available Units Vacant Available Units The following units are currently vacant and open for applications. Interested individuals are encouraged to apply.​ 987 Willoughby Ave. Unit 4D Unit Size: 1-bedroom Rent: $2,479.87 Min Income: $82,548 - $189,540 Rent $2,479.87 103 Liberty Avenue. Unit 6F Unit Size: 1-bedroom Rent: $2,706 Min Income: $101,280 - $189,540 Rent $2,706 1464 Watson Avenue. Unit 506 Unit Size: 1-bedroom Rent: $2,751 Min Income: $99,942 - $189,540 Rent $2,751 1678 Davidson Avenue. Unit 4C Unit Size: Studio Rent: $2,660 Min Income: $98,278 - $168,480 Rent $2,660 1678 Davidson Avenue. Unit 1B Unit Size: Studio Rent: $2,660 Min Income: $98,278 - $168,480 Rent $2,660 Unit Size: Studio Rent: $2,863 Utilities: Included in the Rent Min Income: $98,160 - $168,480 Rent $2,660 1668 Bergen Street. Unit Unit Size: 1-bedroom Rent: $2,706 Min Income: $101,280 - $189,540 Rent $2,706",
  "https://tfc.com/about/affordable-re-rentals": "TF Cornerstone",
  "https://www.thebridgeny.org/news-and-media": "Studio apartment for senior (62+ years) available for rent at The Bridge's Multifamily Housing Building in Morrisania, Bronx Units available for rent at The Bridge's Multifamily Housing Building in Brownsville, Brooklyn 'Neighborhood Navigator' Program Yields Big Results (page 13) This Brooklyn apartment building offers an unexpected take on work from home",
  "https://wavecrestrentals.com/section.php?id=1": "Rent levels and income requirement may vary among the buildings, but the following chart provides general guidelines and ranges. Units below are examples only. Actual unit availability will vary. Applications are vetted on a first come first serve basis. Current tenants may have priority for available rentals under certain circumstances and at sole discretion of management. All applications are placed on waiting lists. As some units and rents are more desirable than others, wait time will vary based on your preferences and your eligibility for certain units. Submitting an application in no way guarantees an apartment. Images are google street view and should be deemed unreliable. The information below is for general browsing information only and should not be assumed as accurate. Apt Rent $803 - $1,928 $28,250 - $68,040 $28,250 - $77,760 $800 - $2,414 $29,260 - $68,040 $29,260 - $77,760 $29,260 - $87,480 $910 - $2,590 $32,790 – $77,760 $32,790 - $87,480 $32,790 - $97,200 $32,790 - $105,000 $1,441 - $3,052 $59,397- $87,480 $59,397 - $97,200 $59,397 - $105,000 $59,397 - $112,800 Rent subject to change",
  "https://yourneighborhoodhousing.com/": "Find an Affordable Apartment Today Find an Affordable Apartment Today Find an Affordable Apartment Today Find an Affordable Apartment Today",
  "https://www.prontohousingrentals.com/": "Household size Identity of all household members Household income Disclaimer: Submitting an application in no way guarantees an apartment. Images should be deemed unreliable. The information below is for general browsing information only and should not be assumed as accurate. Available Units *Actual rent varies based on lease terms. The NYC Rent Guidelines Board approved rent increases for rent-stabilized apartments of 3% for one-year leases commencing on or after October 1, 2025, and on or before September 30, 2026, and 4.5% for two-year leases commencing on or after October 1, 2025, and on or before September 30, 2026. Tenant is responsible for electricity and rent includes gas for cooking. Units available: Rent: $2,037.59 - $2,067.26* $73,152 - $74,169 $136,080 (household size of 1) or $155,520 (household size of 2) Turn your every day into an exemplary day at The Larstrand. Tucked away in a boutique-style building on the Upper West Side in New York, these studio, one, two, and three bedroom apartments exude style and luxury. Come home from a bustling day in the city and relax in the comforts provided by your new pet-friendly home. From high-end finishes and incredible in-home features to an outstanding array of community offerings, you’ll experience what comfort is – and we think you’re going to like it. *Actual rent varies based on lease terms. The NYC Rent Guidelines Board approved rent increases for rent-stabilized apartments of 3% for one-year leases commencing on or after October 1, 2025, and on or before September 30, 2026, and 4.5% for two-year leases commencing on or after October 1, 2025, and on or before September 30, 2026. If approved, you will be offered both rent amounts and lease options to choose from. Tenant is responsible for electricity.New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. Units available: 04E - 40% 1-bedroom Rent: $962.24 - $976.25* $36,728 - $37,209* $45,360 (household size of 1), $51,840 (household size of 2), or $58,320 (household size of 3) **Actual rent varies based on lease terms. The NYC Rent Guidelines Board approved rent increases for rent-stabilized apartments of 3% for one-year leases commencing on or after October 1, 2025, and on or before September 30, 2026, and 4.5% for two-year leases commencing on or after October 1, 2025, and on or before September 30, 2026. If approved, you will be offered both rent amounts and lease options to choose from. Tenant is responsible for electricity. Units available: Rent: $1,141.89 - $1,158.52* $42,442 - $43,012* $68,040 (household size of 1) or $77,760 (household size of 2) Rent: $1,114.03 - $1,130.25* $41,487 - $42,043* $68,040 (household size of 1) or $77,760 (household size of 2) 04B - 60% 1-bedroom Rent: $1,173.15 - $1,190.23* $43,959 - $44,545* $68,040 (household size of 1), $77,760 (household size of 2), or $87,840 (household size of 3) 07J - 60% 1-bedroom Rent: $1,278.35 - $1,296.97* $47,566 - $48,205* $68,040 (household size of 1), $77,760 (household size of 2), or $87,840 (household size of 3) 10F - 60% 1-bedroom Rent: $1,265.60 - $1,284.03* $47,129 - $47,761* $68,040 (household size of 1), $77,760 (household size of 2), or $87,840 (household size of 3) Alexander Crossing delivers brand-new apartment living on the Hudson River waterfront in Downtown Yonkers, a city abuzz with new energy. From our contemporary studio, one, two, and three bedroom layouts to our amenity-rich community, this is the lifestyle you crave. The vibrancy, agency, and quality of Alexander Crossing are reflected in our convenient location where dining, transportation, employment, and entertainment options are as plentiful as they are accessible. Units available: Unit 0702: 40%-65% 1 Bedroom Rent: Based according to 30% of the gross income for the household. $77,350 (household size of 1), $88,400 (household size of 2), or $99,450 (household size of 3) Units 0562, 0634, and 0762: 81% - 100% Studio Rent: Based according to 30% of the gross income for the household.* $119,000 (household size of 1), or $136,000 (household size of 2) Units 0246, and 0632: 81% -100% 1 Bedroom Rent: Varies. Based according to 30% of the gross income for the household.* $119,000 (household size of 1), $136,000 (household size of 2), or $153,000 (household size of 3) Unit 0670 - 81% - 100% 2 Bedroom Rent: Varies. Based according to 30% of the gross income for the household.* $136,000 (household size of 2), $153,000 (household size of 3), $170,000 (household size of 4), or $183,000 (household size of 5) *Actual rent varies based on lease terms. The NYC Rent Guidelines Board approved rent increases for rent-stabilized apartments of 3% for one-year leases commencing on or after October 1, 2025, and on or before September 30, 2026, and 4.5% for two-year leases commencing on or after October 1, 2025, and on or before September 30, 2026. If approved, you will be offered both rent amounts and lease options to choose from. Tenant is responsible for electricity. Units available: Units available: Rent: $1,045.66 - $1,060.88* $39,142 - $39,665 $68,040 (household size of 1) or $77,760 (household size of 2) 07I - 60% 1-bedroom Rent: $1,148.47 - $1,165.20* $43,113 - $43,687* $68,040 (household size of 1), $77,760 (household size of 2), or $87,840 (household size of 3) 1008 - 60% 1-bedroom Rent: $1,125.86 - $1,142.26* $42,338 - $42,900* $68,040 (household size of 1), $77,760 (household size of 2), or $87,840 (household size of 3) 1708 - 60% 1-bedroom Rent: $1,050.60 - $1,065.90* $39,758 - $40,282* $68,040 (household size of 1), $77,760 (household size of 2), or $87,840 (household size of 3) *Actual rent varies based on lease terms. The NYC Rent Guidelines Board approved rent increases for rent-stabilized apartments of 3% for one-year leases commencing on or after October 1, 2025, and on or before September 30, 2026, and 4.5% for two-year leases commencing on or after October 1, 2025, and on or before September 30, 2026. If approved, you will be offered both rent amounts and lease options to choose from. Tenant is responsible for electricity. Units available: Rent: $1,647.85 - $1,671.84* $59,789 - $60,612* $147,420 (household size of 1) or $168,480 (household size of 2) 1205 - 130% 2 bedroom Rent: $2,880.97 - $2,22.93* $103,713 - $105,152* $168,480 (household size of 2), $189,540 (household size of 3), $210,600 (household size of 4), or $227,500 (household size of 5) *Actual rent varies based on lease terms. The NYC Rent Guidelines Board approved rent increases for rent-stabilized apartments of 3% for one-year leases commencing on or after October 1, 2025, and on or before September 30, 2026, and 4.5% for two-year leases commencing on or after October 1, 2025, and on or before September 30, 2026. If approved, you will be offered both rent amounts and lease options to choose from. Tenant is responsible for electricity.New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. Units available: Rent: $1,840.47 - $1,867.27* $66,393 - $67,312* $136,080(household size of 1) or $155,520 (household size of 2) *Actual rent varies based on lease terms. The NYC Rent Guidelines Board approved rent increases for rent-stabilized apartments of 3% for one-year leases commencing on or after October 1, 2025, and on or before September 30, 2026, and 4.5% for two-year leases commencing on or after October 1, 2025, and on or before September 30, 2026. If approved, you will be offered both rent amounts and lease options to choose from. Tenant is responsible for electricity.New York City is committed to the principle of inclusivity in all of its neighborhoods, including supporting New Yorkers to reside in neighborhoods of their choice, regardless of their neighborhood of origin and regardless of the neighborhood into which they want to move. Units available: 130% studio - 1 unit available Rent: $2,254.67 - $2,350.41* $80,594 - $83,877 $147,420 (household size of 1) or $168,480 (household size of 2) 130% 1 bedroom - 6 units available Rent: $2,415.35 - $2,896.74* $86,549 - $103,054* $147,420 (household size of 1), $168,480 (household size of 2) or $189,540 (household size of 3) 130% 2 bedroom - 1 unit available Rent: $3,427.84 - $3,477.76* $122,463 - $124,175* $168,480 (household size of 2), $189,540 (household size of 3), $210,600 (household size of 4) or $227,500 (household size of 5)"
}